BUILD/doc/source/_static/soap_outputs/6.5.314.4301/create_whitelisted_url_step_5_request.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
    <typens:tanium_soap_request xmlns:typens="urn:TaniumSOAP">
      <command>GetObject</command>
      <object_list>
        <white_listed_url>
          <url_regex>regex:http://test.com/.*API_Test.*URL</url_regex>
          <id>29</id>
          <download_seconds>3600</download_seconds>
          <metadata>
            <item>
              <admin_flag>0</admin_flag>
              <name>TConsole.WhitelistedURL.property1</name>
              <value>value1</value>
            </item>
          </metadata>
        </white_listed_url>
      </object_list>
      <options>
        <suppress_object_list>1</suppress_object_list>
      </options>
    </typens:tanium_soap_request>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>